%====================================================
%  Make Matrix Q and S for Zero and Sign Restrictions
%====================================================

%　Rubio-Ramirez, Waggoner, and Zha (2010) RES, p665-696
%  p.679  Sec.5.3. Impulse Response 

% {'g';'y';'dbt';'pi';'int'}; 
% 制約条件の設定
% 短期と長期のインパルス応答の制約 1 --> 1の数は4つ (インパルス応答が0となる制約)
 %　Monetary Policy shock
Q1 =  [ 1 0 0 0 0; ...   % contemporaneous g
        0 0 0 0 0; ...   % y    
        0 1 0 0 0;...     % dbt
        0 0 0 0  0; ...  % pi
        0 0 0 0  0; ...  % int
        0 0 0 0  0; ...   % short run g
        0 0 0 0  0; ...   % y    
        0 0 0 0  0;...     % dbt
        0 0 0 0  0; ...  % pi
        0 0 0 0  0; ...  % int
        0 0 1 0  0; ...   % long run  g
        0 0 0 1  0; ...   % y      
        0 0 0 0  0;...     % dbt
        0 0 0 0  0; ...  % pi
        0 0 0 0  0  ]' ;     % int% 
  
% 短期と長期のインパルス応答の制約 2  --> 1の数は3つ
% 財政政策ショック
Q2 = [0 0 0 0 0 ; ...   % contemporaneous g
      0 0 0 0 0 ; ...   % y
      0 0 0 0 0 ;...     % dbt
      1 0 0 0 0 ; ...  % pi
      0 1 0 0 0 ; ...  % int
      0 0 0 0 0 ; ...   % short run g
      0 0 0 0 0 ; ...   % y
      0 0 0 0 0 ;...     % dbt
      0 0 0 0 0 ; ...  % pi
      0 0 0 0 0 ; ...  % int
      0 0 0 0 0 ; ...   % long run  g
      0 0 1 0 0 ; ...   % y
      0 0 0 0 0 ;...     % dbt
      0 0 0 0 0; ...  % pi
      0 0 0 0 0   ]' ;     % int

 % 短期と長期のインパルス応答の制約 3 --> 1の数は2つ
 % Demand ショック 
Q3 =[0 0 0 0 0 ; ...   % contemporaneous g
          0 0 0 0 0 ; ...   % y
          0 0 0 0 0 ;...     % dbt
          0 0 0 0 0 ; ...  % pi
          0 0 0 0 0 ; ...  % int
          0 0 0 0  0; ...   % short run g
          0 0 0 0  0; ...   % y     
          0 0 0 0  0;...     % dbt
          0 0 0 0  0; ...  % pi
          0 0 0 0  0; ...  % int
          1 0 0 0  0; ...   % long run  g
          0 1 0 0  0; ...   % y    
          0 0 0 0  0;...     % dbt
         0 0 0 0 0; ...  % pi
         0 0 0 0  0  ]' ;     % int
  % 短期と長期のインパルス応答の制約 4 --> 1の数は1つ
  % Supply shock
Q4 = [0 0 0 0 0 ; ...   % contemporaneous g
          0 0 0 0 0 ; ...   % y
          0 0 0 0 0 ;...     % dbt
          0 0 0 0 0 ; ...  % pi
          0 0 0 0 0 ; ...  % int
          0 0 0 0  0; ...   % short run g
          0 0 0 0  0; ...   % y      
          0 0 0 0  0;...     % dbt
          0 0 0 0  0; ...  % pi
          0 0 0 0 0; ...  % int
          1 0 0 0 0; ...   % long run  g
          0 0 0 0 0; ...   % y    
       0 0 0 0  0;...     % dbt
       0 0 0 0  0; ...  % pi
       0 0 0 0  0  ]' ;     % int   

Q=zeros(nk,3*nk,4);
Q(:,:,1) = Q1;
Q(:,:,2) = Q2;
Q(:,:,3) = Q3;
Q(:,:,4) = Q4;
% Q(:,:,5) = Q5;


%---------------------------
%  符号制約 
%---------------------------
  % MP shock
 S1 =[0 0 0 0 0 ; ...   % contemporaneous g
          -1 0 0 0 0 ; ...   % y
          0 0 0 0 0 ;...     % dbt
          0 -1 0 0 0 ; ...  % pi
          0 0 1 0 0 ; ...  % int
         0 0  0 0 0; ...   % short run g
          0 0 0 0 0; ...   % y    
          0 0 0  0 0;...     % dbt
         0 0 0  -1 0; ...  % pi
          0  0 0  0 1; ...  % int
          0 0 0  0 0; ...   % long run  g
        0 0 0  0 0; ...   % y
       0 0 0  0 0;...     % dbt
       0 0 0  0 0; ...  % pi
       0 0 0  0 0  ]' ;     % int

% 財政政策(政府ショック)ショックを起こす
% Gov >0 and GDP>0
S2 = [1 0 0 0 0 ; ...   % contemporaneous g
      0 0 0 0 0 ; ...   % y
      0 0 0 0 0 ;...     % dbt
      0 0 0 0 0 ; ...  % pi
          0 0 0 0 0 ; ...  % int
          0 0 1 0 0 ; ...   % short run g
         0 0 0 0 0 ; ...   % y    
        0 0 0 1 0 ;...     % dbt
        0 0 0 0 0 ; ...  % pi
       0 0 0 0 0 ; ...  % int
       0 0 0 0 0; ...   % long run  g
      0 0 0 0 0 ; ...   % y 
      0 0 0 0 0 ;...     % dbt
      0 0 0 0 0 ; ...  % pi
      0 0 0 0 0  ]' ;     % int

  % Demand shock を起こす
  % r >0 & Pi < 0 & Y<0
S3 = [0 0 0 0 0 ; ...   % contemporaneous g
          1 0 0 0 0 ; ...   % y
          0 0 0 0 0 ;...     % dbt
          0 0 0 0 0 ; ...  % pi
          0 0 0 0 0 ; ...  % int
          0 0 0 0 0; ...   % short run g
        0 1 0  0 0; ...   % y      
      0 0 0  0 0;...     % dbt
      0 0  1  0 0; ...  % pi
      0 0 0  1 0; ...  % int
      0 0 0  0 0; ...   % long run  g
      0 0 0  0 0; ...   % y
      0 0 0 0 0;...     % dbt
      0 0 0  0 0; ...  % pi
      0 0 0  0 0  ]' ;     % int 
  % Supplyショックを起こす 
S4 = [0 0 0 0 0 ; ...   % contemporaneous g
          0 0 0 0 0 ; ...   % y
          0 0 0 0 0 ;...     % dbt
          -1 0 0 0 0 ; ...  % pi
          0 0 0 0 0 ; ...  % int
          0 0 0 0 0; ...   % short run g
         0 1 0 0  0; ...   % y   >0
         0 0 0  0  0;...     % dbt <0
         0 0 -1 0 0; ...  % pi >0
         0 0 0  0  0 ; ...  % int >0
        0 0 0  0 0; ...   % long run  g
        0 0 0  0 0; ...   % y
       0 0 0  0 0;...     % dbt
       0 0 0 0 0; ...  % pi
       0 0 0 0 0  ]' ;     % int
% S=zeros(nk,2*nk,nk);
S=zeros(nk,3*nk,4);
 S(:,:,1) = S1;
 S(:,:,2) = S2;
 S(:,:,3) = S3;
  S(:,:,4) = S4;

% ----------------------------======================================
%  End of setting Matrix
% ==================================================================
